#### Terraform Initialization ⚙️`success`
#### Terraform Plan 📖`success`

<details><summary>Show Plan</summary>

```

terraform
Running plan in the remote backend. Output will stream here. Pressing Ctrl-C
will stop streaming the logs, but will not stop the plan running remotely.

Preparing the remote plan...

The remote workspace is configured to work with configuration at
/infra/instances/staging relative to the target repository.

Terraform will upload the contents of the following directory,
excluding files or directories as defined by a .terraformignore file
at /home/runner/work/actions-hero/actions-hero/.terraformignore (if it is present),
in order to capture the filesystem context the remote workspace expects:
    /home/runner/work/actions-hero/actions-hero

To view this run in a browser, visit:
https://app.terraform.io/app/metaroon/staging/runs/run-xakRZUBKyhntQ2jK

Waiting for the plan to start...

Terraform v1.6.3
on linux_amd64
Initializing plugins and modules...

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create

Terraform will perform the following actions:

  # google_compute_instance.staging_cicd_demo will be created
  + resource "google_compute_instance" "staging_cicd_demo" {
      + can_ip_forward       = false
      + cpu_platform         = (known after apply)
      + current_status       = (known after apply)
      + deletion_protection  = false
      + guest_accelerator    = (known after apply)
      + id                   = (known after apply)
      + instance_id          = (known after apply)
      + label_fingerprint    = (known after apply)
      + machine_type         = "f1-micro"
      + metadata             = {
          + "ssh-keys" = "terraform:ssh-rsa ..........redacted........+q4MTsVqkAXcz6UWWayKIc1PWJVBk8QtvCcQ== ubuntu@staging"
        }
      + metadata_fingerprint = (known after apply)
      + min_cpu_platform     = (known after apply)
      + name                 = "staging-cicd-demo"
      + project              = (known after apply)
      + self_link            = (known after apply)
      + tags                 = [
          + "staging-cicd-demo",
        ]
      + tags_fingerprint     = (known after apply)
      + zone                 = "us-east1-a"

      + boot_disk {
          + auto_delete                = true
          + device_name                = (known after apply)
          + disk_encryption_key_sha256 = (known after apply)
          + kms_key_self_link          = (known after apply)
          + mode                       = "READ_WRITE"
          + source                     = (known after apply)

          + initialize_params {
              + image  = "ubuntu/images/hvm-ssd/ubuntu-xenial-16.04-amd64-server-20180627"
              + labels = (known after apply)
              + size   = (known after apply)
              + type   = (known after apply)
            }
        }

      + network_interface {
          + ipv6_access_type   = (known after apply)
          + name               = (known after apply)
          + network            = "default"
          + network_ip         = (known after apply)
          + stack_type         = (known after apply)
          + subnetwork         = (known after apply)
          + subnetwork_project = (known after apply)

          + access_config {
              + nat_ip       = (known after apply)
              + network_tier = (known after apply)
            }
        }
    }

  # google_compute_project_metadata.ssh_keys will be created
  + resource "google_compute_project_metadata" "ssh_keys" {
      + id       = (known after apply)
      + metadata = {
          + "ssh-keys" = "terraform:ssh-rsa ..........redacted........+q4MTsVqkAXcz6UWWayKIc1PWJVBk8QtvCcQ== ubuntu@staging"
        }
      + project  = (known after apply)
    }

  # google_dns_managed_zone.my_zone will be created
  + resource "google_dns_managed_zone" "my_zone" {
      + description   = "Managed DNS zone for my domain"
      + dns_name      = "your-domain.com."
      + force_destroy = false
      + id            = (known after apply)
      + name          = "my-managed-zone"
      + name_servers  = (known after apply)
      + project       = (known after apply)
      + visibility    = "public"
    }

  # google_dns_record_set.my_instance_dns will be created
  + resource "google_dns_record_set" "my_instance_dns" {
      + id           = (known after apply)
      + managed_zone = "my-managed-zone"
      + name         = "your-instance-dns-name.your-domain.com."
      + project      = (known after apply)
      + rrdatas      = [
          + (known after apply),
        ]
      + ttl          = 300
      + type         = "A"
    }

Plan: 4 to add, 0 to change, 0 to destroy.

Changes to Outputs:
  + instance_dns_name = "your-instance-dns-name.your-domain.com."

```

</details>

*Pusher: @stoXmod, Action: `workflow_dispatch`*